app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["content", "content here"], ["created_at", Wed, 14 May 2014 15:59:42 UTC +00:00], ["name", "MyString"], ["updated_at", Wed, 14 May 2014 15:59:42 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save