app/controllers/tags_controller.rb

INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 14 May 2014 16:00:21 UTC +00:00], ["name", "I'm a tag!"], ["updated_at", Wed, 14 May 2014 16:00:21 UTC +00:00]]
---
  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save

DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
---
  def destroy
    @tag.destroy