app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 14 May 2014 16:00:21 UTC +00:00], ["name", "Name"], ["updated_at", Wed, 14 May 2014 16:00:21 UTC +00:00]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save